InformationRegisters/РегистрацияВремениРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияВремениРабот</Name>
			<Comment>Регистрация времени работ</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КонецРаботы</Name>
					<Comment>Конец работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПакетРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Comment>Рабочее место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтметки</Name>
					<Comment>Вид отметки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтметокВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Comment>Заказ-наряд</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПланированиеПакетовРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПланированиеПакетовРабот</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПакетРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/УРВ_СтатусыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>УРВ_СтатусыРабот</Name>
			<Comment>Статусы работ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнение</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пауза</Name>
					<Comment>Приостановлено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыИспользованияАвторабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыИспользованияАвторабот</Name>
			<Comment>Виды использования авторабот</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
					<Comment>Производство</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Планирование</Name>
					<Comment>Планирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланированиеИПроизводство</Name>
					<Comment>Планирование и производство</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УРВ_ПакетРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УРВ_ПакетРабот</Name>
			<Comment>Пакет работ</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Comment>Рабочее место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УРВ_СтатусыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеАРМ</Name>
					<Comment>Представление АРМ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПерерыва</Name>
					<Comment>Вид перерыва</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УРВ_ВидыПерерывов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаНачалаРабот</Name>
					<Comment>Плановая дата начала работ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОкончанияРабот</Name>
					<Comment>Плановая дата окончания работ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
					<Comment>Сотрудники</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Comment>Сотрудник</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
					<Comment>Работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Comment>Заказ-наряд</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиЗаказНаряда</Name>
							<Comment>Идентификатор строки заказ наряда</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Comment>Работа</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/Job/Ext/Module.bsl
Функция ПроверитьЗанятостьПоста(Пост) 
	СтруктураОтвета = Новый Структура("Ответ, Сообщение");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УРВ_ПакетРабот.Ссылка,
	               |	УРВ_ПакетРабот.РабочееМесто,
	               |	УРВ_ПакетРабот.ПредставлениеАРМ
	               |ИЗ
	               |	Документ.УРВ_ПакетРабот КАК УРВ_ПакетРабот
	               |ГДЕ
	               |	УРВ_ПакетРабот.Статус = &Выполняется
	               |	И УРВ_ПакетРабот.РабочееМесто = &Пост";
				   
	Запрос.Параметры.Вставить("Выполняется", Перечисления.УРВ_СтатусыРабот.Выполнение);
	Запрос.Параметры.Вставить("Пост", Пост);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Выборка.Следующий();  		
		СтруктураОтвета.Ответ = Ложь;
		СтруктураОтвета.Сообщение = Выборка.ПредставлениеАРМ;
		Возврат СтруктураОтвета;
	КонецЕсли;
	СтруктураОтвета.Ответ = Истина;  
    Возврат СтруктураОтвета;
КонецФункции

Функция JobGet(JobGetRequest)
 	JobGetType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "JobGetResponse");
	JobGet = ФабрикаXDTO.Создать(JobGetType);   
	
	ТаблицаОщибок = Новый ТаблицаЗначений;
	ТаблицаОщибок.Колонки.Добавить("Код",	 Новый ОписаниеТипов("Строка"));
	ТаблицаОщибок.Колонки.Добавить("ТекстОшибки",		 Новый ОписаниеТипов("Строка"));
	
	////////////////////////////////////////////////////////////////////////
	JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobGetRequest, JobGet, "0", ТаблицаОщибок);
	Возврат JobGet;  
	////////////////////////////////////////////////////////////////////////
	
    Попытка
		НомерЗаявкиНаРемонт = JobGetRequest.JobGet.DMSAppointmentNo;
	Исключение
		НомерЗаявкиНаРемонт = "";   			
	КонецПопытки;  	
	Попытка
		IDЗаявкиНаРемонт = JobGetRequest.JobGet.DMSAppointmentID;
	Исключение
		IDЗаявкиНаРемонт = "";   			
	КонецПопытки;  	
    Попытка
		НомерЗаказНаряда = JobGetRequest.JobGet.DMSRONo;
	Исключение
		НомерЗаказНаряда = "";
	КонецПопытки;  	
	Попытка
		IDЗаказНаряда = JobGetRequest.JobGet.DMSROID;
	Исключение
		IDЗаказНаряда = "";
	КонецПопытки;  	

	//Попытка
	//	КодКит = JobGetRequest.JobGet.DMSJobNo;
	//Исключение
	//	КодКит = "";
	//КонецПопытки;  
	//Попытка
	//	СтатусРаботы = JobGetRequest.JobGet.DMSJobStatus;
	//Исключение
	//	СтатусРаботы = "";
	//КонецПопытки;   
	//Попытка
	//	ДатаОтметкиНачало = JobGetRequest.JobGet.ScheduledDateTimeFromLocal;
	//Исключение
	//	ДатаОтметкиНачало = Дата('00010101');
	//КонецПопытки;  
	//Попытка
	//	ДатаОтметкиКонец = JobGetRequest.JobGet.ScheduledDateTimeToLocal;
	//Исключение
	//	ДатаОтметкиКонец = Дата('00010101');
	//КонецПопытки;   

	ЗаявкаСсылка = Документы.ЗаявкаНаРемонт.ПустаяСсылка();
	Если ЗначениеЗаполнено(IDЗаявкиНаРемонт) Тогда
		Попытка 
			ID = Новый УникальныйИдентификатор(IDЗаявкиНаРемонт);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JG03";
			НоваяСтрока.ТекстОшибки = "Некорректный идентификатор заявки на ремонт";
			JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobGetRequest, JobGet, "-1", ТаблицаОщибок);
			Возврат JobGet; 
		КонецПопытки;
		ЗаявкаСсылка = Документы.ЗаявкаНаРемонт.ПолучитьСсылку(ID);
		Если ЗаявкаСсылка.ПолучитьОбъект() = Неопределено Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JG03";
			НоваяСтрока.ТекстОшибки = "Заявка на ремонт с указанным идентификатором не найдена";
			JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobGetRequest, JobGet, "-1", ТаблицаОщибок);
			Возврат JobGet;   
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НомерЗаявкиНаРемонт) Тогда 
		ЗаявкаСсылка = Документы.ЗаявкаНаРемонт.НайтиПоНомеру(НомерЗаявкиНаРемонт, ТекущаяДата());
		Если ЗаявкаСсылка.Пустая() Тогда
            НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JG03";
			НоваяСтрока.ТекстОшибки = "Заявка на ремонт с указанным номером не найдена";
			JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobGetRequest, JobGet, "-1", ТаблицаОщибок);
			Возврат JobGet;  	           
		КонецЕсли; 
	КонецЕсли; 
	
	ЗаказНарядСсылка = Документы.ЗаказНаряд.ПустаяСсылка();
	Если ЗначениеЗаполнено(IDЗаказНаряда) Тогда
		Попытка
			ID = Новый УникальныйИдентификатор(IDЗаказНаряда);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JG02";
			НоваяСтрока.ТекстОшибки = "Некорректный идентификатор заказ-наряда";
			JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobGetRequest, JobGet, "-1", ТаблицаОщибок);
			Возврат JobGet;  	
		КонецПопытки;
		ЗаказНарядСсылка = Документы.ЗаказНаряд.ПолучитьСсылку(ID);
		Если ЗаказНарядСсылка.ПолучитьОбъект() = Неопределено Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JG02";
			НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным идентификатором не найден";
			JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobGetRequest, JobGet, "-1", ТаблицаОщибок);
			Возврат JobGet;   
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НомерЗаказНаряда) Тогда 
		ЗаказНарядСсылка = Документы.ЗаказНаряд.НайтиПоНомеру(НомерЗаказНаряда, ТекущаяДата());
		Если ЗаказНарядСсылка.Пустая() Тогда
            НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JG02";
			НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным номером не найден";
			JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobGetRequest, JobGet, "-1", ТаблицаОщибок);
			Возврат JobGet;  	           
		КонецЕсли; 
	КонецЕсли;        		
		
	Если ЗначениеЗаполнено(ЗаявкаСсылка) Тогда
		Если ЗаявкаСсылка.ХозОперация = Справочники.ХозОперации.ЗаявкаНаРемонт Тогда
			JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobGetRequest,JobGet,"0",ТаблицаОщибок);
			Возврат JobGet;  
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкаНаРемонтПланирование.Авторабота,
		               |	ЗаявкаНаРемонтПланирование.РабочееМесто,
		               |	ЗаявкаНаРемонтПланирование.НачалоВыполнения КАК НачалоВыполнения,
		               |	ЗаявкаНаРемонтПланирование.ОкончаниеВыполнения,
		               |	ЗаявкаНаРемонтПланирование.Продолжительность,
		               |	ЗаявкаНаРемонтПланирование.НомерСтроки
		               |ИЗ
		               |	Документ.ЗаявкаНаРемонт.Планирование КАК ЗаявкаНаРемонтПланирование
		               |ГДЕ
		               |	ЗаявкаНаРемонтПланирование.Ссылка = &ЗаявкаСсылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НачалоВыполнения";

		Запрос.Параметры.Вставить("ЗаявкаСсылка", ЗаявкаСсылка);    
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobGetRequest,JobGet,"0",ТаблицаОщибок);
			Возврат JobGet;  
			
		Иначе
			ЗапросИсполнители = Новый Запрос();
			ЗапросИсполнители.Параметры.Вставить("ЗаявкаСсылка", ЗаявкаСсылка);
			ЗапросИсполнители.Текст = "ВЫБРАТЬ
			                          |	ЗаявкаНаРемонтИсполнители.Исполнитель.Код КАК Код,
			                          |	ЗаявкаНаРемонтИсполнители.Исполнитель.Наименование КАК Наименование
			                          |ИЗ
			                          |	Документ.ЗаявкаНаРемонт.Исполнители КАК ЗаявкаНаРемонтИсполнители
			                          |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРемонт.Работы КАК ЗаявкаНаРемонтРаботы
			                          |		ПО ЗаявкаНаРемонтИсполнители.Ссылка = ЗаявкаНаРемонтРаботы.Ссылка
			                          |			И ЗаявкаНаРемонтИсполнители.ИдентификаторРаботы = ЗаявкаНаРемонтРаботы.ИдентификаторРаботы
			                          |ГДЕ
			                          |	ЗаявкаНаРемонтИсполнители.Ссылка = &ЗаявкаСсылка
			                          |	И ЗаявкаНаРемонтРаботы.Работа = &РаботаСсылка";
			
			JobsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfJob");
			Jobs = ФабрикаXDTO.Создать(JobsType);   
			Пока Выборка.Следующий() Цикл
				ВидИспользованияАвтоработы = обПолучитьЗначениеСвойства(Выборка.Авторабота,ПланыВидовХарактеристик.СвойстваОбъектов.ВидИспользованияАвтоработы,Перечисления.ВидыИспользованияАвторабот.Производство);
				Если ВидИспользованияАвтоработы = Перечисления.ВидыИспользованияАвторабот.Планирование Тогда
					Продолжить;
				КонецЕсли;

				JobType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Job");
				Job = ФабрикаXDTO.Создать(JobType); // пакет работ
				
				Job.DMSJobNo = ""; // у нас в Плане ремонта нет пакетов!
				Job.DMSJobID = "";
				Job.DMSRONo = ""; 
				Job.DMSROID = "";
				Job.DMSAppointmentNo = ЗаявкаСсылка.Номер;
				Job.DMSAppointmentID = Строка(ЗаявкаСсылка.УникальныйИдентификатор());
				Job.ServiceLineNumber = ""; // должно быть пустым! Строка(Выборка.НомерСтроки);
				Job.EstimatedHours = Формат(Выборка.Продолжительность,"ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0"); 
				Job.ActualHours = "";
				Job.SkillLevel = ""; 
				Job.DMSJobStatus = "1"; // запланирована

				ManagementFieldsDataType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ManagementFields");
				ManagementFields = ФабрикаXDTO.Создать(ManagementFieldsDataType); 
				Job.ManagementFields = ManagementFields;
				
				DescriptionsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfDescription");
				Descriptions = ФабрикаXDTO.Создать(DescriptionsType); 
				Job.Descriptions = Descriptions;

				CausesType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfCause");
				Causes = ФабрикаXDTO.Создать(CausesType);
				Job.Causes = Causes;  
				
				CorrectionsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfCorrection");
				Corrections = ФабрикаXDTO.Создать(CorrectionsType);
				Job.Corrections = Corrections; 			

				CommentsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfComment");
				Comments = ФабрикаXDTO.Создать(CommentsType);
				Job.Comments = Comments; 			

				OPCodesType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfOPCode");
				OPCodes = ФабрикаXDTO.Создать(OPCodesType);      	  
				// одна работа в пакете
				OPCodeType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "OPCode");
				OPCode = ФабрикаXDTO.Создать(OPCodeType);
	           	OPCode.Code = Выборка.Авторабота.Код; 								
				OPCode.Description = Выборка.Авторабота.Наименование;
				OPCode.EstimatedHours = Формат(Выборка.Продолжительность,"ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");   
				OPCode.ActualHours = "";
				OPCode.SkillLevel = "";
	         	OPCodes.OPCode.Добавить(OPCode);
				Job.OPCodes = OPCodes;
				
				PlanType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Plan");
				Plan = ФабрикаXDTO.Создать(PlanType);    
				Plan.StallID = ""; // для распределения работ по исполнотелям передаём пустые значение
				Plan.StallName = "";

				Plan.ScheduledDateTimeFromLocal = Выборка.НачалоВыполнения;
				Plan.ScheduledDateTimeToLocal = Выборка.ОкончаниеВыполнения;
				TechniciansType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfTechnician");
				Technicians = ФабрикаXDTO.Создать(TechniciansType);
				TechnicianType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Technician");
				
				ЗапросИсполнители.Параметры.Вставить("РаботаСсылка", Выборка.Авторабота);
				ВыборкаИсполнители = ЗапросИсполнители.Выполнить().Выбрать();
				Пока ВыборкаИсполнители.Следующий() Цикл
					Technician = ФабрикаXDTO.Создать(TechnicianType); 
	                Technician.TCEmployeeID = ВыборкаИсполнители.Код;
					Technician.TCEmployeeName = ВыборкаИсполнители.Наименование;
	                Technicians.Technician.Добавить(Technician);
				КонецЦикла;								
				Plan.Technicians = Technicians;
				
		        Job.Plan = Plan; // для Заявки - только план
				
				DispatchType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Dispatch");
				Dispatch = ФабрикаXDTO.Создать(DispatchType); 
				Job.Dispatch = Dispatch;
				
				ActualType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Actual");
				Actual = ФабрикаXDTO.Создать(ActualType); 
				Job.Actual = Actual;

				Jobs.Job.Добавить(Job);   			
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ЗначениеЗаполнено(ЗаказНарядСсылка) Тогда
		ЗапросПакеты = Новый Запрос();
		ЗапросПакеты.Параметры.Вставить("ЗаказНарядСсылка", ЗаказНарядСсылка);
		ЗапросПакеты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                     |	ЗаказНарядРаботы.ПакетРабот КАК IDПакета,
		                     |	ЗаказНарядРаботы.НомерПакета КАК НомерПакета
		                     |ИЗ
		                     |	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		                     |ГДЕ
		                     |	ЗаказНарядРаботы.Ссылка = &ЗаказНарядСсылка";
		
		ВыборкаПакеты = ЗапросПакеты.Выполнить().Выбрать();
		Если ВыборкаПакеты.Количество() = 0 Тогда
			JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobGetRequest, JobGet, "0", ТаблицаОщибок);
			Возврат JobGet;
		КонецЕсли;
		
		ЗапросРегистрация = Новый Запрос;
		ЗапросРегистрация.Параметры.Вставить("ЗаказНарядСсылка", ЗаказНарядСсылка);  
		ЗапросРегистрация.Текст = "ВЫБРАТЬ
		                          |	РегистрацияВремениРабот.ПакетРабот КАК IDПакета,
		                          |	РегистрацияВремениРабот.ВидОтметки КАК ВидОтметки,
		                          |	РегистрацияВремениРабот.Период КАК Начало,
		                          |	РегистрацияВремениРабот.КонецРаботы КАК Конец,
		                          |	РегистрацияВремениРабот.Продолжительность,
		                          |	РегистрацияВремениРабот.Сотрудник.Код КАК СотрудникКод,
		                          |	РегистрацияВремениРабот.Сотрудник.Наименование КАК СотрудникНаименование,
		                          |	РегистрацияВремениРабот.РабочееМесто.Код КАК РабочееМестоКод,
		                          |	РегистрацияВремениРабот.РабочееМесто.Наименование КАК РабочееМестоНаименование
		                          |ИЗ
		                          |	РегистрСведений.РегистрацияВремениРабот КАК РегистрацияВремениРабот
		                          |ГДЕ
		                          |	РегистрацияВремениРабот.ЗаказНаряд = &ЗаказНарядСсылка
		                          |	И РегистрацияВремениРабот.ПакетРабот = &IDПакета
		                          |
		                          |УПОРЯДОЧИТЬ ПО
		                          |	Начало";
		
		ЗапросРаботы = Новый Запрос();
		ЗапросРаботы.Параметры.Вставить("ЗаказНарядСсылка", ЗаказНарядСсылка);
		ЗапросРаботы.Текст = "ВЫБРАТЬ
		                     |	ЗаказНарядРаботы.Работа.Код КАК Код,
		                     |	ЗаказНарядРаботы.Работа.Наименование КАК Наименование,
		                     |	ЗаказНарядРаботы.Количество КАК Количество,
		                     |	ЗаказНарядРаботы.Нормочас КАК Нормочас,
		                     |	ЗаказНарядРаботы.Коэффициент КАК Коэффициент,
		                     |	ЗаказНарядРаботы.НомерПакета КАК НомерПакета,
		                     |	ЗаказНарядРаботы.ПакетЗакрыт КАК ПакетЗакрыт
		                     |ИЗ
		                     |	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		                     |ГДЕ
		                     |	ЗаказНарядРаботы.Ссылка = &ЗаказНарядСсылка
		                     |	И ЗаказНарядРаботы.ПакетРабот = &IDПакета";
		
		JobsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfJob");
		Jobs = ФабрикаXDTO.Создать(JobsType);			
		Пока ВыборкаПакеты.Следующий() Цикл												
            JobType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Job");
			Job = ФабрикаXDTO.Создать(JobType);
			Job.DMSJobID = ВыборкаПакеты.IDПакета;
			Job.DMSJobNo = ВыборкаПакеты.НомерПакета;
			Job.DMSRONo = ЗаказНарядСсылка.Номер; 
			Job.DMSROID = Строка(ЗаказНарядСсылка.УникальныйИдентификатор()); 
            Job.DMSAppointmentNo = ?(ЗначениеЗаполнено(ЗаказНарядСсылка.ДокументОснование), ЗаказНарядСсылка.ДокументОснование.Номер, "");
			Job.DMSAppointmentID = ?(ЗначениеЗаполнено(ЗаказНарядСсылка.ДокументОснование), Строка(ЗаказНарядСсылка.ДокументОснование.УникальныйИдентификатор()), "");
			Job.ServiceLineNumber = "";											
			Job.SkillLevel = "";
			
			ManagementFieldsDataType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ManagementFields");
			ManagementFields = ФабрикаXDTO.Создать(ManagementFieldsDataType); 
			Job.ManagementFields = ManagementFields;
			
			DescriptionsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfDescription");
			Descriptions = ФабрикаXDTO.Создать(DescriptionsType); 
			Job.Descriptions = Descriptions;

			CausesType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfCause");
			Causes = ФабрикаXDTO.Создать(CausesType);
			Job.Causes = Causes;  
			
			CorrectionsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfCorrection");
			Corrections = ФабрикаXDTO.Создать(CorrectionsType);
			Job.Corrections = Corrections; 			

			CommentsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfComment");
			Comments = ФабрикаXDTO.Создать(CommentsType);
			Job.Comments = Comments; 			

			// автоработы пакета
			OPCodesType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfOPCode");
			OPCodes = ФабрикаXDTO.Создать(OPCodesType);
			ЗапросРаботы.Параметры.Вставить("IDПакета", ВыборкаПакеты.IDПакета);
			ВыборкаРаботы = ЗапросРаботы.Выполнить().Выбрать();
			ВсегоЧасов = 0;
			ПакетЗакрыт = Ложь;
			Пока ВыборкаРаботы.Следующий() Цикл
				OPCodeType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "OPCode");
				OPCode = ФабрикаXDTO.Создать(OPCodeType);
	            OPCode.Code = ВыборкаРаботы.Код; 								
				OPCode.Description = ВыборкаРаботы.Наименование;
				OPCode.EstimatedHours = Формат(ВыборкаРаботы.Коэффициент * ВыборкаРаботы.Количество, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");   
				OPCode.ActualHours = "";
				OPCode.SkillLevel = "";
	            OPCodes.OPCode.Добавить(OPCode);
				ВсегоЧасов = ВсегоЧасов + ВыборкаРаботы.Коэффициент * ВыборкаРаботы.Количество;
				ПакетЗакрыт = ПакетЗакрыт Или ВыборкаРаботы.ПакетЗакрыт;
			КонецЦикла;
			Если ПакетЗакрыт Тогда
				Job.DMSJobStatus = "4"; // завершен
			КонецЕсли;
			Job.EstimatedHours = Формат(ВсегоЧасов, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0"); 
            Job.OPCodes = OPCodes; 
			
			ЗапросРегистрация.Параметры.Вставить("IDПакета", ВыборкаПакеты.IDПакета);
			ВыборкаРегистрации = ЗапросРегистрация.Выполнить().Выбрать();			
			Если ВыборкаРегистрации.Количество() = 0 Тогда
				Job.DMSJobStatus = "1"; // запланирована
				ActualType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Actual");
				Actual = ФабрикаXDTO.Создать(ActualType);
				Job.Actual = Actual;
				
				DispatchType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Dispatch");
				Dispatch = ФабрикаXDTO.Создать(DispatchType); 
				Dispatch.StallID = ""; // для распределения работ по исполнотелям передаём пустые значение
				Dispatch.StallName = "";
		
				МенеджерПланирование = РегистрыСведений.ПланированиеПакетовРабот.СоздатьМенеджерЗаписи();
				МенеджерПланирование.ЗаказНаряд = ЗаказНарядСсылка;
				МенеджерПланирование.ПакетРабот = ВыборкаПакеты.IDПакета;
				МенеджерПланирование.Прочитать();
				Если МенеджерПланирование.Выбран() Тогда
					Dispatch.ScheduledDateTimeFromLocal = МенеджерПланирование.ДатаНачала;
					Dispatch.ScheduledDateTimeToLocal = МенеджерПланирование.ДатаОкончания;
				Иначе
					Продолжить;
				КонецЕсли;					
				
				TechniciansType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfTechnician");
				Technicians = ФабрикаXDTO.Создать(TechniciansType);
				TechnicianType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Technician");
				ЗапросИсполнители = Новый Запрос();
				ЗапросИсполнители.Параметры.Вставить("ЗаказНарядСсылка", ЗаказНарядСсылка);
				ЗапросИсполнители.Параметры.Вставить("IDПакета", ВыборкаПакеты.IDПакета);
				ЗапросИсполнители.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				                          |	ЗаказНарядИсполнители.Исполнитель.Код КАК Код,
				                          |	ЗаказНарядИсполнители.Исполнитель.Наименование КАК Наименование
				                          |ИЗ
				                          |	Документ.ЗаказНаряд.Исполнители КАК ЗаказНарядИсполнители
				                          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
				                          |		ПО ЗаказНарядИсполнители.ИдентификаторРаботы = ЗаказНарядРаботы.ИдентификаторРаботы
				                          |			И ЗаказНарядИсполнители.Ссылка = ЗаказНарядРаботы.Ссылка
				                          |ГДЕ
				                          |	ЗаказНарядРаботы.Ссылка = &ЗаказНарядСсылка
				                          |	И ЗаказНарядРаботы.ПакетРабот = &IDПакета";
				
				ВыборкаИсполнители = ЗапросИсполнители.Выполнить().Выбрать();
				Пока ВыборкаИсполнители.Следующий() Цикл
					Technician = ФабрикаXDTO.Создать(TechnicianType); 
	                Technician.TCEmployeeID = ВыборкаИсполнители.Код;
					Technician.TCEmployeeName = ВыборкаИсполнители.Наименование;
	                Technicians.Technician.Добавить(Technician);
				КонецЦикла;								

				Dispatch.Technicians = Technicians;
				Job.Dispatch = Dispatch;   
																
				PlanType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Plan");
				Plan = ФабрикаXDTO.Создать(PlanType); 
				Job.Plan = Plan;
				
			Иначе			
				ActualType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Actual");
				Actual = ФабрикаXDTO.Создать(ActualType);          
				Actual.StallID = "";
				Actual.StallName = ""; 
				
				ActualTimeLogsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfActualTimeLog");
				ActualTimeLogs = ФабрикаXDTO.Создать(ActualTimeLogsType);
				ActualHours = 0;
				Пока ВыборкаРегистрации.Следующий() Цикл
					ActualTimeLogType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ActualTimeLog");
					ActualTimeLog = ФабрикаXDTO.Создать(ActualTimeLogType);					
					ActualTimeLog.StartDateTimeLocal = ВыборкаРегистрации.Начало;
					ActualTimeLog.EndDateTimeLocal = ВыборкаРегистрации.Конец;
					ActualTimeLog.TCEmployeeID = ВыборкаРегистрации.СотрудникКод;
					ActualTimeLog.TCEmployeeName = ВыборкаРегистрации.СотрудникНаименование;       					
					Если ВыборкаРегистрации.ВидОтметки = Справочники.ВидыОтметокВремени.Работа Тогда
						ActualTimeLog.Status = "1"; // старт (работа)
						Если ЗначениеЗаполнено(ВыборкаРегистрации.Продолжительность) Тогда
							ActualHours = ActualHours + ВыборкаРегистрации.Продолжительность;
						Иначе							
							Job.DMSJobStatus = "2"; // в процессе
						КонецЕсли;
					ИначеЕсли ВыборкаРегистрации.ВидОтметки = Справочники.ВидыОтметокВремени.Простой Тогда
						ActualTimeLog.Status = "2"; // конец
						Job.DMSJobStatus = "4"; // завершен
					ИначеЕсли ВыборкаРегистрации.ВидОтметки = Справочники.ВидыОтметокВремени.ПерерывОбед Тогда
						ActualTimeLog.Status = "3"; // пауза
						Если Не ЗначениеЗаполнено(ВыборкаРегистрации.Продолжительность) Тогда
							Job.DMSJobStatus = "3"; // пауза
							ActualTimeLog.PauseReasonCode = ""; //ВыборкаВторая.ВидПерерыва.Код;
		                    ActualTimeLog.PauseReasonComment = "Перерыв на обед"; //ВыборкаВторая.ВидПерерыва.Наименование;
						КонецЕсли;		
					КонецЕсли;           									
					ActualTimeLogs.ActualTimeLog.Добавить(ActualTimeLog);
				КонецЦикла;
				Actual.ActualTimeLogs = ActualTimeLogs;				
				Job.ActualHours = Формат(ActualHours, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		
				JobCommentsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "ArrayOfJobComment");
				JobComments = ФабрикаXDTO.Создать(JobCommentsType);
				Actual.JobComments = JobComments;                      
                Job.Actual = Actual;
				
				DispatchType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Dispatch");
				Dispatch = ФабрикаXDTO.Создать(DispatchType); 
				Job.Dispatch = Dispatch;   
																
				PlanType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "Plan");
				Plan = ФабрикаXDTO.Создать(PlanType); 
				Job.Plan = Plan;					
			КонецЕсли;
			
			Jobs.Job.Добавить(Job); 				
		КонецЦикла;									   	   
		
	Иначе
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA02";
		НоваяСтрока.ТекстОшибки = "Не заполено ни одно из обязат. полей: <Номер заявки> или <Номер заказ-наряда>";
		JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobGetRequest, JobGet, "-1", ТаблицаОщибок);
		Возврат JobGet;  			
	КонецЕсли;
	
    JobGet.Jobs = Jobs;
	JobGet = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobGetRequest, JobGet, "1", ТаблицаОщибок);
	Возврат JobGet;  
КонецФункции

Функция JobChange(JobChangeRequest)
	// Вставить содержимое обработчика.
	JobChangeType = ФабрикаXDTO.Тип("http://wa.dms.webservice/JobGetRequest", "JobChangeResponse");
	JobChange = ФабрикаXDTO.Создать(JobChangeType);   
	
	ТаблицаОщибок = Новый ТаблицаЗначений;
	ТаблицаОщибок.Колонки.Добавить("Код",	 Новый ОписаниеТипов("Строка"));
	ТаблицаОщибок.Колонки.Добавить("ТекстОшибки",		 Новый ОписаниеТипов("Строка"));
	
	Попытка
		НомерЗаказНаряда = JobChangeRequest.JobChange.DMSRONo;
	Исключение
		НомерЗаказНаряда = "";   			
	КонецПопытки;  	
	
	Попытка
		IDЗаказНаряда = JobChangeRequest.JobChange.DMSROID;
	Исключение
		IDЗаказНаряда = "";   			
	КонецПопытки;  	
	
	ЗаказНарядСсылка = Документы.ЗаказНаряд.ПустаяСсылка();
	Если ЗначениеЗаполнено(IDЗаказНаряда) Тогда
		Попытка
			ID = Новый УникальныйИдентификатор(IDЗаказНаряда);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JC02";
			НоваяСтрока.ТекстОшибки = "Некорректный идентификатор заказ-наряда";
			JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobChangeRequest, JobChange, "-1", ТаблицаОщибок);
			Возврат JobChange;  		
		КонецПопытки;
		ЗаказНарядСсылка = Документы.ЗаказНаряд.ПолучитьСсылку(ID);
		Если ЗаказНарядСсылка.ПолучитьОбъект() = Неопределено Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JC02";
			НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным идентификатором не найден";
			JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobChangeRequest, JobChange, "-1", ТаблицаОщибок);
			Возврат JobChange;  		
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НомерЗаказНаряда) Тогда 
		ЗаказНарядСсылка = Документы.ЗаказНаряд.НайтиПоНомеру(НомерЗаказНаряда, ТекущаяДата());
		Если ЗаказНарядСсылка.Пустая() Тогда
            НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JC02";
			НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным номером не найден";
			JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobChangeRequest, JobChange, "-1", ТаблицаОщибок);
			Возврат JobChange;  		
		КонецЕсли;
	Иначе
        НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "JC02";
		НоваяСтрока.ТекстОшибки = "Не заданы реквизиты Заказ-наряда";
		JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobChangeRequest, JobChange, "-1", ТаблицаОщибок);
		Возврат JobChange;  				
	КонецЕсли;        		
	
	Попытка
		ПакетРабот = JobChangeRequest.JobChange.DMSJobNo;
	Исключение
		ПакетРабот = "";
	КонецПопытки;  
	
	Попытка
		ПакетРаботID = JobChangeRequest.JobChange.DMSJobID;
	Исключение
		ПакетРаботID = "";
	КонецПопытки;  		
	тзПакетРабот = Новый ТаблицаЗначений();
	Если ЗначениеЗаполнено(ПакетРаботID) Тогда
		ЗапросПакетРабот = Новый Запрос();
		ЗапросПакетРабот.УстановитьПараметр("ЗаказНарядСсылка", ЗаказНарядСсылка);
		ЗапросПакетРабот.УстановитьПараметр("ПакетРаботID", ПакетРаботID);
		ЗапросПакетРабот.Текст = "ВЫБРАТЬ
		                     |	ЗаказНарядРаботы.Работа.Код КАК Код,
		                     |	ЗаказНарядРаботы.Работа.Наименование КАК Наименование,
		                     |	ЗаказНарядРаботы.Количество КАК Количество,
		                     |	ЗаказНарядРаботы.Нормочас КАК Нормочас,
		                     |	ЗаказНарядРаботы.Коэффициент КАК Коэффициент,
		                     |	ЗаказНарядРаботы.НомерПакета КАК НомерПакета,
		                     |	ЗаказНарядРаботы.ПакетЗакрыт КАК ПакетЗакрыт
		                     |ИЗ
		                     |	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		                     |ГДЕ
		                     |	ЗаказНарядРаботы.Ссылка = &ЗаказНарядСсылка
		                     |	И ЗаказНарядРаботы.ПакетРабот = &ПакетРаботID";
		
		тзПакетРабот = ЗапросПакетРабот.Выполнить().Выгрузить();
		Если тзПакетРабот.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JC02";
			НоваяСтрока.ТекстОшибки = "Некорректный идентификатор пакета работ";
			JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
			Возврат JobChange;  		
		КонецЕсли;
	КонецЕсли;  	
	
	МассивПакетаРабот = Новый Массив;
	Попытка
		МассивРабот = JobChangeRequest.JobChange.OPCodes;  
		Для Каждого Работа Из МассивРабот.OPCode Цикл
			МассивПакетаРабот.Добавить(СОКРЛП(Работа.Code));
			// здесь можно проверить корректность кодов
		КонецЦикла;  		
	Исключение
	КонецПопытки;  
	
	// данные для отметки времени
    Попытка
		КодЦеха = JobChangeRequest.JobChange.Actual.StallID;
		Цех = Справочники.Цеха.НайтиПоКоду(КодЦеха);
	Исключение
		КодЦеха = "";
		Цех = Справочники.Цеха.ПустаяСсылка();
	КонецПопытки;  	
	Попытка
		МассивДействий = JobChangeRequest.JobChange.Actual.ActualTimeLogs;  
		Для Каждого Действие Из МассивДействий.ActualTimeLog Цикл
			ТекущаяОтметка = Действие;	  
		КонецЦикла;     		
	Исключение
		ТекущаяОтметка = Неопределено;
	КонецПопытки;  	
	Если ТекущаяОтметка <> Неопределено Тогда
		Попытка 
			КодСотрудника = ТекущаяОтметка.TCEmployeeID;
		Исключение
			КодСотрудника = "";	
		КонецПопытки;     		
		Попытка 
			Действие = ТекущаяОтметка.Status;
		Исключение
			Действие = "";	
		КонецПопытки;
        Попытка 
			КодПаузы = ТекущаяОтметка.PauseReasonCode;
		Исключение
			КодПаузы = "";	
		КонецПопытки; 
	КонецЕсли;   	
	
	// данные для формирования нового пакета работ
	Попытка
		Dispatch = JobChangeRequest.JobChange.Dispatch;
	Исключение
		Dispatch = Неопределено;
	КонецПопытки;
	Если Dispatch <> Неопределено Тогда
		Попытка
			КодЦехаПланирования = Dispatch.StallID; 			
		Исключение
			КодЦехаПланирования = "";
		КонецПопытки;  	
		Попытка
			НачалоПланирования = Dispatch.ScheduledDateTimeFromLocal; 			
		Исключение
			НачалоПланирования = Дата('00010101');
		КонецПопытки;  	
		Попытка
			КонецПланирования = Dispatch.ScheduledDateTimeToLocal; 			
		Исключение
			КонецПланирования = Дата('00010101');
		КонецПопытки;  	
		Попытка
			МассивИсп = Dispatch.Technicians;  
			Для Каждого Исп Из МассивИсп.Technician Цикл
				КодСотрудника = Исп.TCEmployeeID;	  
			КонецЦикла;     		
		Исключение
			КодСотрудника = "";
		КонецПопытки;  
	КонецЕсли;

	Если Dispatch <> Неопределено И обЗначениеНеЗаполнено(ПакетРаботID) Тогда  // сформировать новый пакет
		Исполнитель = Справочники.Сотрудники.НайтиПоКоду(КодСотрудника);
		Если Исполнитель = Справочники.Сотрудники.ПустаяСсылка() ИЛИ Исполнитель = Неопределено Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JC12";
			НоваяСтрока.ТекстОшибки = "Сотрудник с указанным кодом не найден";
			JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
			Возврат JobChange;  
		КонецЕсли;      	
		
		Если МассивПакетаРабот.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JC09";
			НоваяСтрока.ТекстОшибки = "Пакет не содержит работ";
			JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
			Возврат JobChange;  
		КонецЕсли;		
		
		ЗапросНомерПакета = Новый Запрос();
		ЗапросНомерПакета.УстановитьПараметр("ЗаказНарядСсылка", ЗаказНарядСсылка);
		ЗапросНомерПакета.Текст = "ВЫБРАТЬ
		                          |	ЗаказНарядРаботы.НомерПакета КАК НомерПакета
		                          |ИЗ
		                          |	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		                          |ГДЕ
		                          |	ЗаказНарядРаботы.Ссылка = &ЗаказНарядСсылка
		                          |
		                          |УПОРЯДОЧИТЬ ПО
		                          |	НомерПакета УБЫВ";
		
		ВыборкаНомерПакета = ЗапросНомерПакета.Выполнить().Выбрать();
		НовыйНомерПакета = 1;
		Если ВыборкаНомерПакета.Следующий() Тогда
			НовыйНомерПакета = ВыборкаНомерПакета.НомерПакета + 1;
		КонецЕсли;
		
		ЗаказНарядОбъект = ЗаказНарядСсылка.ПолучитьОбъект();
		ПакетРаботID = Строка(Новый УникальныйИдентификатор());
		Для Каждого КодРаботыПакета Из МассивПакетаРабот Цикл
			РаботаССылка = Справочники.Автоработы.НайтиПоКоду(КодРаботыПакета);
			Если РаботаСсылка.Пустая() Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "JC09";
				НоваяСтрока.ТекстОшибки = "Работа с указанным кодом не найдена";
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
				Возврат JobChange;  
			КонецЕсли;
			СтрокаРабота = ЗаказНарядОбъект.Работы.Найти(РаботаСсылка, "Работа");
			Если СтрокаРабота <> Неопределено Тогда
				СтрокаРабота.НомерПакета = НовыйНомерПакета;
				СтрокаРабота.ПакетРабот = ПакетРаботID;
				
				НетИсполнителя = Истина;
				Для Каждого СтрокаИсполнитель Из ЗаказНарядОбъект.Исполнители Цикл
					Если СтрокаИсполнитель.ИдентификаторРаботы = СтрокаРабота.ИдентификаторРаботы И СтрокаИсполнитель.Исполнитель = Исполнитель Тогда
						НетИсполнителя = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НетИсполнителя Тогда
					НовыйИсполнитель = ЗаказНарядОбъект.Исполнители.Добавить();
					НовыйИсполнитель.ИдентификаторРаботы = СтрокаРабота.ИдентификаторРаботы;
					НовыйИсполнитель.Исполнитель = Исполнитель;
					НовыйИсполнитель.Цех = Исполнитель.Цех;
					НовыйИсполнитель.Процент = 100;
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;		
		ЗаказНарядОбъект.ОбменДанными.Загрузка = Истина;
		ЗаказНарядОбъект.Записать();
		
		МенеджерПланирование = РегистрыСведений.ПланированиеПакетовРабот.СоздатьМенеджерЗаписи();
		МенеджерПланирование.ЗаказНаряд = ЗаказНарядСсылка;
		МенеджерПланирование.ПакетРабот = ПакетРаботID;
		МенеджерПланирование.ДатаНачала = НачалоПланирования;
		МенеджерПланирование.ДатаОкончания = КонецПланирования;
		МенеджерПланирование.Записать();
		
	ИначеЕсли Dispatch <> Неопределено И ЗначениеЗаполнено(ПакетРаботID) Тогда // изменение/расформирование пакета работ 
		ЗаказНарядОбъект = ЗаказНарядСсылка.ПолучитьОбъект();								
		Если НачалоПланирования = Дата('00010101') Тогда
			Для Каждого СтрокаРабота Из ЗаказНарядОбъект.Работы Цикл
				Если СтрокаРабота.ПакетРабот = ПакетРаботID Тогда
					СтрокаРабота.НомерПакета = 0;
					СтрокаРабота.ПакетРабот = "";
					
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("ИдентификаторРаботы", СтрокаРабота.ИдентификаторРаботы);
					НайденныеИсполнители = ЗаказНарядОбъект.Исполнители.НайтиСтроки(ПараметрыОтбора);
					Для Каждого СтрокаИсполнитель Из НайденныеИсполнители Цикл
						ЗаказНарядОбъект.Исполнители.Удалить(СтрокаИсполнитель);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			ЗаказНарядОбъект.ОбменДанными.Загрузка = Истина;
			ЗаказНарядОбъект.Записать();
			
			МенеджерПланирование = РегистрыСведений.ПланированиеПакетовРабот.СоздатьМенеджерЗаписи();
			МенеджерПланирование.ЗаказНаряд = ЗаказНарядСсылка;
			МенеджерПланирование.ПакетРабот = ПакетРаботID;
			МенеджерПланирование.Удалить();
			
			JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"1",ТаблицаОщибок,"Пакет успешно удален.");
			Возврат JobChange;
			
		Иначе
			Если МассивПакетаРабот.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "JC09";
				НоваяСтрока.ТекстОшибки = "Пакет не содержит работ";
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
				Возврат JobChange;  
			КонецЕсли;	
		
			ЗапросНомерПакета = Новый Запрос();
			ЗапросНомерПакета.УстановитьПараметр("ЗаказНарядСсылка", ЗаказНарядСсылка);
			ЗапросНомерПакета.УстановитьПараметр("ПакетРаботID", ПакетРаботID);
			ЗапросНомерПакета.Текст = "ВЫБРАТЬ
			                          |	ЗаказНарядРаботы.НомерПакета КАК НомерПакета
			                          |ИЗ
			                          |	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
			                          |ГДЕ
			                          |	ЗаказНарядРаботы.Ссылка = &ЗаказНарядСсылка
			                          |	И ЗаказНарядРаботы.ПакетРабот = &ПакетРаботID";
			
			ВыборкаНомерПакета = ЗапросНомерПакета.Выполнить().Выбрать();
			НомерПакета = 1;
			Если ВыборкаНомерПакета.Следующий() Тогда
				НомерПакета = ВыборкаНомерПакета.НомерПакета;
			Иначе				
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "JC02";
				НоваяСтрока.ТекстОшибки = "Пакет работ с указанным идентификатором не найден";
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
				Возврат JobChange;  
			КонецЕсли;
			
			Для Каждого КодРаботыПакета Из МассивПакетаРабот Цикл
				РаботаССылка = Справочники.Автоработы.НайтиПоКоду(КодРаботыПакета);
				Если РаботаСсылка.Пустая() Тогда
					НоваяСтрока = ТаблицаОщибок.Добавить();
					НоваяСтрока.Код = "JC09";
					НоваяСтрока.ТекстОшибки = "Работа с указанным кодом не найдена";
					JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
					Возврат JobChange;  
				КонецЕсли;
				СтрокаРабота = ЗаказНарядОбъект.Работы.Найти(РаботаСсылка, "Работа");
				Если СтрокаРабота <> Неопределено Тогда
					СтрокаРабота.НомерПакета = НомерПакета;
					СтрокаРабота.ПакетРабот = ПакетРаботID;
				КонецЕсли;			
			КонецЦикла;		
		КонецЕсли;
		ЗаказНарядОбъект.ОбменДанными.Загрузка = Истина;
		ЗаказНарядОбъект.Записать();
		
	ИначеЕсли ЗначениеЗаполнено(Действие) И ЗначениеЗаполнено(ПакетРаботID) Тогда // отметки времени по пакету работ
		
		Если Действие = "1" Тогда // начать работу					
			Исполнитель = Справочники.Сотрудники.НайтиПоКоду(КодСотрудника);
			Если Исполнитель = Справочники.Сотрудники.ПустаяСсылка() ИЛИ Исполнитель=Неопределено Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "JC12";
				НоваяСтрока.ТекстОшибки = "Сотрудник с указанным кодом не найден";
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
				Возврат JobChange; 
			Иначе
				Цех = Исполнитель.Цех;
			КонецЕсли;
			
			Если МассивПакетаРабот.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "JC09";
				НоваяСтрока.ТекстОшибки = "Пакет не содержит работ";
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
				Возврат JobChange;  
			КонецЕсли;	
			
			Если ЗакрытьСтарыйИнтервал(Исполнитель, ЗаказНарядСсылка, ПакетРаботID) Тогда
				НачатьНовыйИнтервал(Справочники.ВидыОтметокВремени.Работа, Исполнитель, ЗаказНарядСсылка, ПакетРаботID);
			Иначе
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobChangeRequest, JobChange, "0", ТаблицаОщибок);
				Возврат JobChange;				
			КонецЕсли;
			
		ИначеЕсли Действие = "2" Тогда // закрыть пакет работ
			Исполнитель = Справочники.Сотрудники.НайтиПоКоду(КодСотрудника);
			Если Исполнитель = Справочники.Сотрудники.ПустаяСсылка() ИЛИ Исполнитель=Неопределено Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "JC12";
				НоваяСтрока.ТекстОшибки = "Сотрудник с указанным кодом не найден";
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
				Возврат JobChange;  
			КонецЕсли;
		
			Если МассивПакетаРабот.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "JC09";
				НоваяСтрока.ТекстОшибки = "Пакет не содержит работ";
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
				Возврат JobChange;  
			КонецЕсли;		
			
			Если ЗакрытьСтарыйИнтервал(Исполнитель, ЗаказНарядСсылка, ПакетРаботID) Тогда
				НачатьНовыйИнтервал(Справочники.ВидыОтметокВремени.Простой, Исполнитель, ЗаказНарядСсылка, ПакетРаботID);
			Иначе
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobChangeRequest, JobChange, "0", ТаблицаОщибок);
				Возврат JobChange;				
			КонецЕсли;		
			ЗаказНарядОбъект = ЗаказНарядСсылка.ПолучитьОбъект();
			Для Каждого СтрокаРабота Из ЗаказНарядОбъект.Работы Цикл
				Если СтрокаРабота.ПакетРабот = ПакетРаботID Тогда
					СтрокаРабота.ПакетЗакрыт = Истина;  
				КонецЕсли;
			КонецЦикла;		
			ЗаказНарядОбъект.ОбменДанными.Загрузка = Истина;
			ЗаказНарядОбъект.Записать();
			
		ИначеЕсли Действие = "3" Тогда // остановить работу (перерыв)				
			Исполнитель = Справочники.Сотрудники.НайтиПоКоду(КодСотрудника);
			Если Исполнитель = Справочники.Сотрудники.ПустаяСсылка() ИЛИ Исполнитель=Неопределено Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "JC12";
				НоваяСтрока.ТекстОшибки = "Сотрудник с указанным кодом не найден";
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
				Возврат JobChange;  
			КонецЕсли;
			
			Если МассивПакетаРабот.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "JC09";
				НоваяСтрока.ТекстОшибки = "Пакет не содержит работ";
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
				Возврат JobChange;  
			КонецЕсли;	
			
			// проверить ЗначениеЗаполнено(КодПаузы)
			//ВидОтметки = Справочники.ВидыОтметокВремени.НайтиПоКоду(КодПаузы);
			// проверить ЗначениеЗаполнено(ВидОтметки), передать в НачатьНовыйИнтервал(...) 
			Если ЗакрытьСтарыйИнтервал(Исполнитель, ЗаказНарядСсылка, ПакетРаботID) Тогда
				НачатьНовыйИнтервал(Справочники.ВидыОтметокВремени.ПерерывОбед, Исполнитель, ЗаказНарядСсылка, ПакетРаботID);
			Иначе
				JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobChangeRequest, JobChange, "0", ТаблицаОщибок);
				Возврат JobChange;				
			КонецЕсли;
			
		Иначе                  		
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "JC15";
			НоваяСтрока.ТекстОшибки = "Неверный статус отметки времени по пакету работ";
			JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest",JobChangeRequest,JobChange,"-1",ТаблицаОщибок);
			Возврат JobChange;
		КонецЕсли;
	КонецЕсли;     	

    JobChange = обПолучитьВозвратWAError("http://wa.dms.webservice/JobGetRequest", JobChangeRequest, JobChange, "1", ТаблицаОщибок, ПакетРаботID);
	Возврат JobChange; 

КонецФункции

Процедура НачатьНовыйИнтервал(Статус, Исполнитель, ЗаказНаряд, ПакетРабот)
	МенеджерЗаписи = РегистрыСведений.РегистрацияВремениРабот.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период    = ТекущаяДата();
	МенеджерЗаписи.Сотрудник = Исполнитель;
	МенеджерЗаписи.ЗаказНаряд   = ЗаказНаряд;
	МенеджерЗаписи.РабочееМесто = Исполнитель.Цех;
	МенеджерЗаписи.ВидОтметки= Статус;
	МенеджерЗаписи.ПакетРабот   = ПакетРабот;
	
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

 Функция ЗакрытьСтарыйИнтервал(Исполнитель, ЗаказНаряд, ПакетРабот)
	ЗапросИнтервал = Новый Запрос();
	ЗапросИнтервал.УстановитьПараметр("Исполнитель", Исполнитель);
	ЗапросИнтервал.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
	ЗапросИнтервал.УстановитьПараметр("ПакетРабот", ПакетРабот);
	ЗапросИнтервал.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	ЗапросИнтервал.Текст = "ВЫБРАТЬ
	                       |	РегистрацияВремениРаботСрезПоследних.Период КАК Период,
	                       |	РегистрацияВремениРаботСрезПоследних.ВидОтметки
	                       |ИЗ
	                       |	РегистрСведений.РегистрацияВремениРабот.СрезПоследних КАК РегистрацияВремениРаботСрезПоследних
	                       |ГДЕ
	                       |	РегистрацияВремениРаботСрезПоследних.Сотрудник = &Исполнитель
	                       |	И РегистрацияВремениРаботСрезПоследних.ЗаказНаряд = &ЗаказНаряд
	                       |	И РегистрацияВремениРаботСрезПоследних.ПакетРабот = &ПакетРабот
	                       |	И РегистрацияВремениРаботСрезПоследних.КонецРаботы = &ПустаяДата
	                       |	И РегистрацияВремениРаботСрезПоследних.Продолжительность = 0
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	Период УБЫВ";
	
	ВыборкаИнтервал = ЗапросИнтервал.Выполнить().Выбрать();
	Если ВыборкаИнтервал.Следующий() Тогда
		МенеджерЗаписи = РегистрыСведений.РегистрацияВремениРабот.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период    = ВыборкаИнтервал.Период;
		МенеджерЗаписи.Сотрудник = Исполнитель;
		МенеджерЗаписи.ЗаказНаряд = ЗаказНаряд;
		МенеджерЗаписи.ВидОтметки = ВыборкаИнтервал.ВидОтметки;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			КонецИнтервала = ТекущаяДата();
			МенеджерЗаписи.КонецРаботы = КонецИнтервала;
			МенеджерЗаписи.Продолжительность = (КонецИнтервала - МенеджерЗаписи.Период) / 3600;
			МенеджерЗаписи.Записать(Истина);
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;		
	Иначе
		Возврат Истина;
	КонецЕсли;		
КонецФункции
